Автоматизированная_проверка_конфигураций_демо/src/Catalogs/Конфигурации/Конфигурации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Конфигурации</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>КаталогКонфигурации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаЗапускаПлатформы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьВОтчетность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоОбычныйРежим</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключенияБезПривязки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаКонфигурацию</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьОбъектыСПрефиксомУдалить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьОшибкиВСППР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучатьОтветственныхЗаМетаданныеИзСППР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппироватьОшибкиПоОтветственному</name>
    <type>
      <types>EnumRef.ВидыГруппировокСППР</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКонфигурацииСППР</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияКонфигурацииСППР</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнениеКТекстуОшибкиСППР</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогХранилища</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательХранилища</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольХранилища</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Расписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПроверки</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АктивностьРасписания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЗапуска</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПроверкиВручную</name>
    <type>
      <types>CatalogRef.ВариантыПроверки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПроверкиПоРасписанию</name>
    <type>
      <types>CatalogRef.ВариантыПроверки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоБиблиотека</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнятьРассылкуРезультатовПроверки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьОсобенностиПоРасписанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлуВыгрузкиОсобенностей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РасписаниеВыгрузкиОсобенностей</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательВыгрузкиОсобенностей</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыгрузкиОсобенностей</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширеннаяПроверкаПоДополнительнымТребованиям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонПисьма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьВсеОшибкиКакОсобенностиПоРасписанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьАвтораОсобенности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <comment>0 - Конфигурация, 1 - Расширения, 2 - Конфигурация и расширения</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИС_ИспользоватьКаталогФайловXML</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИС_КаталогФайловXML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИС_GUID</name>
    <comment>ИнфоСофт, Фоминых В.С., 23.09.2018</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсключенияИзПроверки</name>
    <attributes>
      <name>Использовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидИсключения</name>
      <type>
        <types>EnumRef.ВидыИсключенийИзПроверки</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Расширение</name>
      <type>
        <types>CatalogRef.Расширения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Библиотеки</name>
    <attributes>
      <name>БиблиотечнаяКонфигурация</name>
      <type>
        <types>CatalogRef.Конфигурации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПричиныОсобенностей</name>
    <attributes>
      <name>ПричинаОсобенности</name>
      <type>
        <types>CatalogRef.ПричиныОсобенности</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расписания</name>
    <attributes>
      <name>АктивностьРасписания</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантПроверкиПоРасписанию</name>
      <type>
        <types>CatalogRef.ВариантыПроверки</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантПроверкиПоРасписаниюСтрокой</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяЗапуска</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПользовательПроверки</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Расписание</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>РегистрироватьВсеОшибкиКакОсобенностиПоРасписанию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонПисьма</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расширения</name>
    <attributes>
      <name>Расширение</name>
      <type>
        <types>CatalogRef.Расширения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Автоматизированная_проверка_конфигураций_демо/src/InformationRegisters/НайденныеОшибки/НайденныеОшибки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НайденныеОшибки</name>
  <resources>
    <name>Ошибка</name>
    <type>
      <types>CatalogRef.ОбнаруживаемыеОшибки</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостояниеОшибки</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>АвторОсобенности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПомещенияВОсобенности</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>МестоОбнаружения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Уточнение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>999</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОсобенности</name>
    <type>
      <types>CatalogRef.ПричиныОсобенности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийИдентификаторОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.СтруктураКонфигурации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Правило</name>
    <type>
      <types>CatalogRef.Правила</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Автоматизированная_проверка_конфигураций_демо/src/Enums/СостояниеОшибки/СостояниеОшибки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеОшибки</name>
  <enumValues>
    <name>Зарегистрирована</name>
  </enumValues>
  <enumValues>
    <name>Исправлена</name>
  </enumValues>
  <enumValues>
    <name>Особенность</name>
  </enumValues>
</mdclass:Enum>

Автоматизированная_проверка_конфигураций_демо/src/Catalogs/Конфигурации/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ПолучитьКоличествоОсобенностейИзФоновогоЗадания(Конфигурация, АдресХранилища) Экспорт
	
	Количество = ПолучитьКоличествоОсобенностейКонфигурации(Конфигурация);
	ПоместитьВоВременноеХранилище(Количество, АдресХранилища);
	
КонецПроцедуры

Функция ПолучитьКоличествоОсобенностейКонфигурации(Конфигурация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(НайденныеОшибки.Номер) КАК КоличествоОсобенностей
	|ИЗ
	|	РегистрСведений.НайденныеОшибки КАК НайденныеОшибки
	|ГДЕ
	|	НайденныеОшибки.Объект.Владелец.Владелец = &Конфигурация
	|	И НайденныеОшибки.Состояние = &Состояние";
	
	Запрос.УстановитьПараметр("Конфигурация", Конфигурация);
	Запрос.УстановитьПараметр("Состояние", Перечисления.СостояниеОшибки.Особенность);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КоличествоОсобенностей;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

#КонецОбласти

#КонецЕсли
